In [1]:
import pandas as pd

## Data analysis
1. description
2. diagnosis
3. prediction
4. action/prescription

In [2]:
# column names
cols=['user_id','movie_id','rating','ts']

In [3]:
df=pd.read_csv('u.data')

In [4]:
df.head()

      0\t50\t5\t881250949
0    0\t172\t5\t881250949
1    0\t133\t1\t881250949
2  196\t242\t3\t881250949
3  186\t302\t3\t891717742
4   22\t377\t1\t878887116

In [5]:
# read the file
df=pd.read_csv('u.data',sep='\t')

In [6]:
df.head()

     0   50  5  881250949
0    0  172  5  881250949
1    0  133  1  881250949
2  196  242  3  881250949
3  186  302  3  891717742
4   22  377  1  878887116

In [7]:
# list comparison
a=[2,4,5,67,8]

In [8]:
#b=[4,5,56,67,6]

In [9]:
b=[]
for i in a:
    b.append(i*2)

In [10]:
item_cols=['movie_id','title']+[str(i) for i in range(22)]

In [11]:
df=pd.read_csv('u.data',sep='\t',names=cols)

In [15]:
#read the other file
df1=pd.read_csv('u.item',sep='|',encoding="ISO-8859-1",names=item_cols)[['movie_id','title']]

In [17]:
df1.shape

(1682, 2)

# Exploratory data analysis

In [19]:
df.sample(5)

       user_id  movie_id  rating         ts
40879      541       651       5  883864782
47297      625       647       4  891263822
5790        56        31       4  892679259
83962      903        52       3  891466551
2977       290       476       3  880475837

In [20]:
df1.sample(5)

      movie_id                    title
1514      1515  Wings of Courage (1995)
349        350            Fallen (1998)
244        245  Devil's Own, The (1997)
340        341     Critical Care (1997)
116        117         Rock, The (1996)

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100003 entries, 0 to 100002
Data columns (total 4 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   user_id   100003 non-null  int64
 1   movie_id  100003 non-null  int64
 2   rating    100003 non-null  int64
 3   ts        100003 non-null  int64
dtypes: int64(4)
memory usage: 3.1 MB

In [22]:
df.describe()

             user_id       movie_id         rating            ts
count  100003.000000  100003.000000  100003.000000  1.000030e+05
mean      462.470876     425.520914       3.529864  8.835288e+08
std       266.622454     330.797791       1.125704  5.343791e+06
min         0.000000       1.000000       1.000000  8.747247e+08
25%       254.000000     175.000000       3.000000  8.794487e+08
50%       447.000000     322.000000       4.000000  8.828269e+08
75%       682.000000     631.000000       4.000000  8.882600e+08
max       943.000000    1682.000000       5.000000  8.932866e+08

In [23]:
df.describe(include='all')
# this will show all the columns by default it show only nuimeric data

             user_id       movie_id         rating            ts
count  100003.000000  100003.000000  100003.000000  1.000030e+05
mean      462.470876     425.520914       3.529864  8.835288e+08
std       266.622454     330.797791       1.125704  5.343791e+06
min         0.000000       1.000000       1.000000  8.747247e+08
25%       254.000000     175.000000       3.000000  8.794487e+08
50%       447.000000     322.000000       4.000000  8.828269e+08
75%       682.000000     631.000000       4.000000  8.882600e+08
max       943.000000    1682.000000       5.000000  8.932866e+08

# try to find different data type
1. string with categorial info
2. string with random stuff
3. number with quantified info
4. number with categorial info
5. andom number or id sort of data

In [25]:
df.columns

Index(['user_id', 'movie_id', 'rating', 'ts'], dtype='object')

In [26]:
df['rating'].unique()

array([5, 1, 3, 2, 4], dtype=int64)

In [27]:
df['rating'].nunique()

5

In [28]:
df['user_id'].nunique()

944

In [29]:
df['movie_id'].nunique()

1682

In [30]:
## merging dataframes

In [32]:
movie=pd.merge(df,df1,on='movie_id')

In [33]:
movie.head()

   user_id  movie_id  rating         ts             title
0        0        50       5  881250949  Star Wars (1977)
1      290        50       5  880473582  Star Wars (1977)
2       79        50       4  891271545  Star Wars (1977)
3        2        50       5  888552084  Star Wars (1977)
4        8        50       5  879362124  Star Wars (1977)

In [ ]:
ratings=pd.DataFrame(movie.groupby('title')['rating'].mean().sort_values(ascending=False))

In [ ]:
ratings['count']=movie['title'].value_counts()

In [ ]:
ratings.head(10)

In [ ]:
ratings.sort_values(by='count',ascending=False).head(10)

### remove the redundant or useless column i.e. ts

In [35]:
movie.drop('ts',axis=1,inplace=True)

In [36]:
movie.head()

   user_id  movie_id  rating             title
0        0        50       5  Star Wars (1977)
1      290        50       5  Star Wars (1977)
2       79        50       4  Star Wars (1977)
3        2        50       5  Star Wars (1977)
4        8        50       5  Star Wars (1977)

In [37]:
movie.columns

Index(['user_id', 'movie_id', 'rating', 'title'], dtype='object')

In [38]:
# find the number of rating for each movie
movie['title'].value_counts().head(10)

Star Wars (1977)                 584
Contact (1997)                   509
Fargo (1996)                     508
Return of the Jedi (1983)        507
Liar Liar (1997)                 485
English Patient, The (1996)      481
Scream (1996)                    478
Toy Story (1995)                 452
Air Force One (1997)             431
Independence Day (ID4) (1996)    429
Name: title, dtype: int64

In [39]:
# find number of rating for each movie
# movie.groupby('title').count()

In [40]:
# find the aversge rating of each movie
movie.groupby('title')['rating'].mean().sort_values(ascending=False).head(10)

title
They Made Me a Criminal (1939)                       5.0
Marlene Dietrich: Shadow and Light (1996)            5.0
Saint of Fort Washington, The (1993)                 5.0
Someone Else's America (1995)                        5.0
Star Kid (1997)                                      5.0
Great Day in Harlem, A (1994)                        5.0
Aiqing wansui (1994)                                 5.0
Santa with Muscles (1996)                            5.0
Prefontaine (1997)                                   5.0
Entertaining Angels: The Dorothy Day Story (1996)    5.0
Name: rating, dtype: float64